### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [86]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [2]:
player_count = len(purchase_data['SN'].unique())
total_players_df = pd.DataFrame({'Total Players': [player_count]})
total_players_df

   Total Players
0            576

In [2]:
# Original output from answer, for reference

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [3]:
# Calculationts:
unique_items = len(purchase_data['Item ID'].unique())
average_price = purchase_data['Price'].mean()
purchases_count = len(purchase_data)
total_revenue = purchase_data['Price'].sum()

# Create a dataframe
purchasing_analysis_df = pd.DataFrame({'Number of Unique Items': [unique_items],
                                       'Average Price': average_price,
                                       'Number of Purchases': purchases_count,
                                       'Total Revenue': total_revenue

})

# Formatting
purchasing_analysis_df['Average Price'] = purchasing_analysis_df['Average Price'].map('${:.2f}'.format)
purchasing_analysis_df['Total Revenue'] = purchasing_analysis_df['Total Revenue'].map('${:,}'.format)

purchasing_analysis_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [3]:
# Original output from answer, for reference

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [4]:
# Step 1: Group by gender and look at unique player IDs within each gender in a new dataframe
gender_group = purchase_data.groupby('Gender')
gender_sn_df = pd.DataFrame(gender_group['SN'].value_counts())
gender_sn_df.head()

                   SN
Gender SN
Female Chamjask73   3
       Ialallo29    3
       Phyali88     3
       Tyidaim51    3
       Umolrian85   3

In [5]:
# Step 2: Clean up newly created dataframe for further analysis
gender_sn_df = gender_sn_df.rename(columns={'SN': 'Number of Purchases'})
gender_sn_df = gender_sn_df.reset_index()
gender_sn_df.head()

   Gender          SN  Number of Purchases
0  Female  Chamjask73                    3
1  Female   Ialallo29                    3
2  Female    Phyali88                    3
3  Female   Tyidaim51                    3
4  Female  Umolrian85                    3

In [6]:
# Step 3: Create another dataframe to summarize gender demographics
true_gender_count_df = pd.DataFrame(gender_sn_df['Gender'].value_counts())
true_gender_count_df = true_gender_count_df.rename(columns={'Gender': 'Total Count'})

gender_percentage = true_gender_count_df['Total Count'] / player_count * 100
true_gender_count_df['Percentage of Players'] = gender_percentage

true_gender_count_df['Percentage of Players'] = true_gender_count_df['Percentage of Players'].map('{:.2f}%'.format)

true_gender_count_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

In [4]:
# Original output from answer, for reference

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [96]:
# Step 1: Run calculations to get the metrics
purchase_count_gender = gender_group['Purchase ID'].count()
avg_purchase_gender = gender_group['Price'].mean()
total_purchase_gender = gender_group['Price'].sum()

# To get the average total purchase amount per person by different genders, use the total purchase amount in each gender group and divide it by the number of unique players in the same gender group
avg_total_purchase_player_gender = total_purchase_gender / gender_group['SN'].apply(lambda x: len(x.unique()))

In [97]:
# Step 2: Create a summary data frame to hold the results
purchasing_analysis_gender_df = pd.DataFrame({'Purchase Count': purchase_count_gender,
                                    'Average Purchase Price': avg_purchase_gender,
                                    'Total Purchase Value': total_purchase_gender,
                        'Avg Total Purchase per Person': avg_total_purchase_player_gender
})
purchasing_analysis_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [94]:
# Step 3: Before displaying the data frame, format the data
purchasing_analysis_gender_df['Average Purchase Price'] = purchasing_analysis_gender_df['Average Purchase Price'].map('${:.2f}'.format)
purchasing_analysis_gender_df['Total Purchase Value'] = purchasing_analysis_gender_df['Total Purchase Value'].map('${:,.2f}'.format)
purchasing_analysis_gender_df['Avg Total Purchase per Person'] = purchasing_analysis_gender_df['Avg Total Purchase per Person'].map('${:.2f}'.format)

purchasing_analysis_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [5]:
# Original output from answer, for reference

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [76]:
# Step 1: Establish bins for ages. To do that, analyze the age data first
print(purchase_data['Age'].describe())

count    780.000000
mean      22.714103
std        6.659444
min        7.000000
25%       20.000000
50%       22.000000
75%       25.000000
max       45.000000
Name: Age, dtype: float64

In [77]:
# 50% of the data is distributed between age 20 and 25, and the maximum is only 45. An evenly distributed bins of 5 years of age seem to work, but we will imitate the answer provided to leave out the 0-5 range
bins = [0, 9, 14, 19, 24, 29, 34, 39, 45]
group_names = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [87]:
# Step 2: Categorize the existing players using the age bins.
purchase_data_age = purchase_data.copy()
purchase_data_age['Age Group'] = pd.cut(purchase_data_age["Age"], bins, labels=group_names, include_lowest=True)
purchase_data_age

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [88]:
# Step 3: Group by the Age Group column so we can summary total count and percentage of players within each age group bin
age_group = purchase_data_age.groupby('Age Group')

total_count = age_group['SN'].apply(lambda x: len(x.unique()))
percentage_of_players = total_count / sum(total_count) * 100

In [121]:
# Step 4: Create a summary data frame to hold the results and format the data
age_demographics_df = pd.DataFrame({'Total Count': total_count,
                                    'Percentage of Players': percentage_of_players
})

age_demographics_df['Percentage of Players'] = age_demographics_df['Percentage of Players'].map('{:.2f}%'.format)

age_demographics_df

           Total Count Percentage of Players
Age Group
<10                 17                 2.95%
10-14               22                 3.82%
15-19              107                18.58%
20-24              258                44.79%
25-29               77                13.37%
30-34               52                 9.03%
35-39               31                 5.38%
40+                 12                 2.08%

In [6]:
# Original output from answer, for reference

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [107]:
# Step 1: Run calculations to get the metrics
purchase_data_age = purchase_data_age.rename(columns={'Age Group': 'Age Ranges'})
age_group2 = purchase_data_age.groupby('Age Ranges')
purchase_count_age = age_group2['Purchase ID'].count()
avg_purchase_age = age_group2['Price'].mean()
total_purchase_age = age_group2['Price'].sum()
avg_total_purchase_player_age = total_purchase_age / age_group2['SN'].apply(lambda x: len(x.unique()))

In [108]:
# Step 2: Create a summary data frame to hold the results
purchasing_analysis_age_df = pd.DataFrame({'Purchase Count': purchase_count_age,
                                    'Average Purchase Price': avg_purchase_age,
                                    'Total Purchase Value': total_purchase_age,
                        'Avg Total Purchase per Person': avg_total_purchase_player_age
})
purchasing_analysis_age_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [110]:
# Step 3: Before displaying the data frame, format the data
purchasing_analysis_age_df['Average Purchase Price'] = purchasing_analysis_age_df['Average Purchase Price'].map('${:.2f}'.format)
purchasing_analysis_age_df['Total Purchase Value'] = purchasing_analysis_age_df['Total Purchase Value'].map('${:,.2f}'.format)
purchasing_analysis_age_df['Avg Total Purchase per Person'] = purchasing_analysis_age_df['Avg Total Purchase per Person'].map('${:.2f}'.format)

purchasing_analysis_age_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

In [7]:
# Original output from answer, for reference

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [127]:
# Step 1: Run calculations to get the metrics
sn_group = purchase_data.groupby('SN')

purchase_count_sn = sn_group['Purchase ID'].count()
avg_purchase_sn = sn_group['Price'].mean()
total_purchase_sn = sn_group['Price'].sum()

In [128]:
# Step 2: Create a summary data frame to hold the results
top_spenders_df = pd.DataFrame({'Purchase Count': purchase_count_sn,
                                    'Average Purchase Price': avg_purchase_sn,
                                    'Total Purchase Value': total_purchase_sn
})
top_spenders_df

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [131]:
# Step 3: Sort the total purchase value column in descending order
top_spenders_df = top_spenders_df.sort_values('Total Purchase Value', ascending=False)
top_spenders_df.head(5)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [132]:
# Step 4: Format the data
top_spenders_df['Average Purchase Price'] = top_spenders_df['Average Purchase Price'].map('${:.2f}'.format)
top_spenders_df['Total Purchase Value'] = top_spenders_df['Total Purchase Value'].map('${:,.2f}'.format)

top_spenders_df.head(5)

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [8]:
# Original output from answer, for reference

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [133]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [142]:
# Step 1: Run calculations to get the metrics
item_group = purchase_data.groupby(['Item ID', 'Item Name'])

purchase_count_item = item_group['Purchase ID'].count()
avg_purchase_item = item_group['Price'].mean()
total_purchase_item = item_group['Price'].sum()

# Step 2: Create a summary data frame to hold the results
popular_items = pd.DataFrame({'Purchase Count': purchase_count_item,
                              'Item Price': avg_purchase_item,
                              'Total Purchase Value': total_purchase_item
})
top_spenders_df

# Step 3: Sort the total purchase value column in descending order
popular_items = popular_items.sort_values('Purchase Count', ascending=False)

# Step 4: Format the data
popular_items_format = popular_items.copy()
popular_items_format['Item Price'] = popular_items_format['Item Price'].map('${:.2f}'.format)
popular_items_format['Total Purchase Value'] = popular_items_format['Total Purchase Value'].map('${:,.2f}'.format)

popular_items_format.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

In [9]:
# Original output from answer, for reference

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [143]:
profitable_items = popular_items.copy()
profitable_items = profitable_items.sort_values('Total Purchase Value', ascending=False)

profitable_items['Item Price'] = profitable_items['Item Price'].map('${:.2f}'.format)
profitable_items['Total Purchase Value'] = profitable_items['Total Purchase Value'].map('${:,.2f}'.format)

profitable_items.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80

In [10]:
# Original output from answer, for reference

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80